<?php
// Порушення PRS-12: 4.4/4.5- Відсутні пробіли після коми і перед двокрапкою
// Порушення PSR-12: 5.1- Відсутні відступ та перенесення рядка перед фігурною дужкою
function raiseToPower(float $number,int $power):float{
    return $number**$power; // Порушення PSR-12: 6.2 - Відсутні пробіли навколо оператора піднесення до ступеня
}

// Порушення PRS-12: 4.4/4.5- Відсутні пробіли після коми і перед двокрапкою
// Порушення PSR-12: 5.1- Відсутні відступ та перенесення рядка перед фігурною дужкою
function raiseToPowerReference(float &$number,int $power):void{
    $number=$number**$power; // Порушення PSR-12: 6.2 - Відсутні пробіли навколо оператора порівняння і піднесення до ступеня.
}

// Порушення PRS-12: 4.4/4.5- Відсутні пробіли перед двокрапкою
// Порушення PSR-12: 5.1- Відсутні відступ та перенесення рядка перед фігурною дужкою
function getNumericInput():float|int{
    // Порушення: 5.1- Відсутні відступи і нові рядки в умовній конструкції
    $number=trim(fgets(STDIN));if(!is_numeric($number)){echo "Ви ввели не число!\n";exit;}
    return $number;
}